#Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range() и выведите его на экран.
num = range(18, 1, -4)
lst = list(num)
print(lst)